var n001 = "الخدمات الإلكترونية";
var n002 = "ديوان وزارة الداخلية";
var n003 = "الاستعلام العام عن رصيد مدفوعات الخدمات المتبقي";
var n004 = "الاستعلام العام عن طلبات التصاريح";
var n005 = "الاستعلام العام عن المعاملات";
var n006 = "الأحوال المدنية";
var n007 = "الاستعلام عن معاملة في الاحوال المدنية";
var n008 = "الاستعلام عن صلاحية الهوية";
var n009 = "حجز موعد";
var n0010 = "الإستقدام";
var n0011 = "الاستعلام عن طلبات تأشيرات العمل";
var n0012 = "الجوازات";
var n0013 = "الاستعلام العام عن أحقية القيام بالحج";
var n0014 = "الاستعلام عن العمالة الجديدة والزائرين";
var n0015 = "الاستعلام العام عن البصمة";
var n0016 = "الاستعلام عن وصول العمالة";
var n0017 = "الاستعلام عن التأمين الصحي";
var n0018 = "الاستعلام العام عن حالة تأشيرة خروج وعودة";
var n0019 = "الاستعلام عن صلاحية الإقامة";
var n0020 = "حجز موعد";
var n00201 = "حجز موعد";
var n0021 = "المرور";
var n0022 = "الاستعلام عن المخالفات المرورية";
var n0023 = "الاستعلام العام عن صلاحية التأمين على المركبات";
var n0024 = "الاستعلام عن تفاصيل المخالفة المرورية";
var n0025 = "إمارات المناطق";
var n0026 = "الاستعلام عن المعاملات";
var n0027 = "الحج والعمرة";
var n0028 = "الاستفسار عن تصريح حج";
var n0029 = "خدمات التأشيرات";
var n0030 = "تجديد الإقامة";
var n0031 = "تصاريح السفر للتابعين";
var n0032 = "نقل الخدمات";
var n0033 = "إصدار جواز السفر";
var n0034 = "تمديد تأشيرة زيارة";
var n0035 = "خدمات التابعين";
var n0036 = "إصدار الإقامة";
var n0037 = "تجديد جواز السفر";
var n0038 = "الأمن العام";
var n0039 = "التبليغ عن مشتبه به بالانتماء للفئات الضالة";
var n0040 = "الاستعلام عن رخص السلاح";
var n0041 = "الإدارة العامة لشؤون الوافدين";
var n0042 = "استقدام العوائل للمقيمين";
var n0043 = "تفويض الخدمات الإلكترونية";
var n0044 = "تفويض الخدمات الإلكترونية";
var n0045 = "توصيل الوثائق بالبريد";
var n0046 = "توصيل الوثائق بالبريد";

function setVisibility(id, visibility) {
    var element = document.getElementById(id);
    if (element) {
        element.style.display = visibility;
    }
}
